[
    {
        "Question Category":"Follow Up Question, Seeking Confirmation, OSS User, Coding Question, Seeking Code Review, Uses Photos, New User,  Issue closed as completed",
        "Questions":"Is this a satisfactory solution?\n\nImage: Photo of Solution\n\nImage: Photo of Solution",
        "Best Human Answer":"The UI looks good so far. Please open a draft pull request so we can begin reviewing the code changes.\n\nThe code doesn't need to be complete before the review starts. It's always better to catch potential issues early, as fixing them is easier before they compound."
    },
    {
        "Question Category":"Usability Question, Implied Question, Scope Question, See Notes, Requesting Issue Creation, Context Needed, Large Text, Spanning Responses, Alike To Other Problem,  Issue closed as completed",
        "Questions":"Steps to reproduce the behaviour\nOpen database with an entry A containing the string \"xyz-abc\" (choose as appropriate)\nSearch for xyz AND abc\nEntry A does not appear in the results although it should (it did before the search feature update).\nEntry A will appear in the search results when using xyz abc (which in Lucene implies an OR used).\nHope anybody can reproduce this issue. I found the issue when looking for strings in the \"comments\" field but I tested that the issue should occur with the title field and perhaps other fields as well. The issue does not occur when using \"xyz abc\", so it seems the new search now expects strings to occur as substrings in separate words. I'm using search groups a lot and found that behavior today only because some entries where missing after the search-group migration.\n\nUpdate: It also seems that the new search does not recognise string occurrences in the keywords anymore.\n\nThis is perhaps a matter of taste, but the new search feature exposing Lucene syntax directly to the user feels surprisingly counterintuitive. I'm more familiar with regular expression syntax. But I'm sure I'll adapt. \n\nImplied: Why is It this way? Can It be changed?",
        "Best Human Answer":"#This is perhaps a matter of taste, but the new search feature exposing Lucene syntax directly to the user feels surprisingly counterintuitive. I'm more familiar with regular expression syntax. But I'm sure I'll adapt.\n\nI agree. Lucene search will find match the entry of interest if you search for xyz AND *abc. The explanation is that your search expression needs to match the entire string, from the word boundary to the target, but not necessarily beyond the target. In other words, all Lucene searches would start with ^ if expressed as regex, and the beginning of the string is each token rather than the entire field of interest.\n\nYou can also search with regex, but still need to match the beginning of the word\/token. To do this, just enclose the expression in \/ characters. Now you will get a match for \/.*abc\/, \/...-abc\/, \/.{3}-abc\/, \/.*ab\/, and so on. However, lookahead and look-behind don't seem to work in the search bar so you will just need to include previous or upcoming characters in the expression to constrain the results.\n\n...\n\n#The issue does not occur when using \"xyz abc\", so it seems the new search now expects strings to occur as substrings in separate words.\n\nThis is correct, except that the unit of analysis is not words, per se, but \"tokens\" that happen to contain separate words. The string xyz abc is interpreted as two tokens whereas \"xyz-abc\" is interpreted as one token."
        
    },
    {
        "Question Category":"Follow Up Question, Usability Question, Context Needed, Pointed to Resource, Quotes Asker, Seeking Confirmation",
        "Questions":"Context: Above\n\nRegarding the keywords, it seems to work, if the search string is part of the first keyword. But if there are more keywords and the string is only occurring in one of the keywords later in the list, search does not find it anymore. I wonder whether there is something strange happening when combining the keywords for Lucene's search?\n\nMy current workaround is to copy keywords into the comments and then it seems to work fine.",
        "Best Human Answer":"#Update: It also seems that the new search does not recognise string occurrences in the keywords anymore.\n\nKeywords exhibit the same behaviour as other fields, so you need to add a wildcard to match the beginning of the token to match a target that occurs anywhere other than the beginning of the token. For example, keywords:*abc.\n\nNote: The documentation at https:\/\/lucene.apache.org\/core\/2_9_4\/queryparsersyntax.html states that \"You cannot use a * or ? symbol as the first character of a search.\" but the results in JabRef contradict this. Searching for *abc or ?yz-abc` matches \"xyz-abc\" whether it occurs in the title, keywords, or comment field.\n\nEdit: I am currently using JabRef 6.0--2024-09-25--91d0709"
        
    },
    {
        "Question Category":"Usability Question, Implied Question, Coding Question, Uses Photos, , Pointed to Resource, Requesting Issue Creation, Responce From Oliver",
        "Questions":"When I do a full index, the list of tasks is shown as complete, but there is some unnamed (!) task running:\n\nImage: Screenshot of specified issue\n\nMaybe, this is related to #11701\n\nImplied: Why does this happen \/ Can someone fix it?",
        "Best Human Answer":"   EventHandler<WorkerStateEvent> taskHandler = evt -> {\n            if (!isRetainTasks()) {\n                if (evt.getEventType().equals(\n                        WorkerStateEvent.WORKER_STATE_SUCCEEDED)\n                        || evt.getEventType().equals(\n                        WorkerStateEvent.WORKER_STATE_CANCELLED)\n                        || evt.getEventType().equals(\n                        WorkerStateEvent.WORKER_STATE_FAILED)) {\n                    getTasks().remove(evt.getSource());\n                }\n            }\n        };\n\nCloses #11819.\nThe issue will be resolved if the PR for hiding completed background tasks (#11821) is merged.\n\nHowever, this PR fixes the issue even if hiding completed tasks isn't implemented. Progress was shown with an empty title and no progress because sometimes background indexing tasks start but have no files to add to the index.\nThere was no control to show the task to the user after it started executing. This PR added this option.\nCalling task.showToUser(true) after executeWith will show the task if it's still running.\n\nMandatory checks\n Change in CHANGELOG.md described in a way that is understandable for the average user (if applicable)\n Tests created for changes (if applicable)\n Manually tested changed features in running JabRef (always required)\n Screenshots added in PR description (for UI changes)\n Checked developer's documentation: Is the information available and up to date? If not, I outlined it in this pull request.\n Checked documentation: Is the information available and up to date? If not, I created an issue at https:\/\/github.com\/JabRef\/user-documentation\/issues or, even better, I submitted a pull request to the documentation repository.\n\n"
    },
    {
        "Question Category":"Follow Up Question, Seeking Confirmation, OSS User, Coding Question, Seeking Code Review, Uses Photos",
        "Questions":"Hello @subhramit, while I solve this isue I noticed this error:\n\nImage: Screenshot of Error\n\nCan we solve this problem with an if statement that checks for null in the RedoAction.excecute method?",
        "Best Human Answer":"Did this error exist before? (if yes, then could you elaborate the steps to reproduce it?)\n\nElse, if this was triggered after your changes, submit a PR so that we can review and make suggestions."
        
    },
    {
        "Question Category":"Responce From Oliver, Coding Question, Implied Question, Context Needed, Pointed to Resource, Uses Photos",
        "Questions":"Context: User was attempting an OSS issue where they were making the \"file rename\" dialouge box resizable\n\nhi, I am getting this issue\n\norg.jabref.logic.citationstyle.CitationStyleTest > numericPropertyMatches(boolean, String) [1] true, ieee.csl FAILED\n  org.opentest4j.AssertionFailedError: Citation style not found: ieee.csl ==> expected: <true> but was: <false>\norg.jabref.logic.citationstyle.CitationStyleTest > numericPropertyMatches(boolean, String) [2] false, apa.csl FAILED\n  org.opentest4j.AssertionFailedError: Citation style not found: apa.csl ==> expected: <true> but was: <false>\norg.jabref.logic.citationstyle.CitationStyleTest > numericPropertyMatches(boolean, String) [3] true, vancouver.csl FAILED\n  org.opentest4j.AssertionFailedError: Citation style not found: vancouver.csl ==> expected: <true> but was: <false>\norg.jabref.logic.citationstyle.CitationStyleTest > numericPropertyMatches(boolean, String) [4] false, chicago-author-date.csl FAILED\n  org.opentest4j.AssertionFailedError: Citation style not found: chicago-author-date.csl ==> expected: <true> but was: <false>\norg.jabref.logic.citationstyle.CitationStyleTest > numericPropertyMatches(boolean, String) [5] true, nature.csl FAILED\n\n  org.opentest4j.AssertionFailedError: Citation style not found: nature.csl ==> expected: <true> but was: <false>\nWhen i am trying to run the project on my local system.\n\nImplied: Why?",
        "Best Human Answer":"@Niharika0612 please try https:\/\/devdocs.jabref.org\/code-howtos\/faq.html#orgjabreflogiccitationstylecitationstyle-discovercitationstyles-error-could-not-find-any-citation-style-tried-with-ieeecsl"
        
    },
    {
        "Question Category":"Uses Photos, See Notes, Coding Question, Follow Up Question",
        "Questions":"I tried, and it said to execute these commands, which i did\n\nPhoto:  User executing the commands and getting an error\n\nBut my csl-styles and the csl-locales files come up empty. i checked the past history, but i have not made any changes in the file. How do i get the files in this case?\n\nPhoto: Empty csl styles folder",
        "Best Human Answer":"Hi @Niharika0612. Did you follow the steps to set up a local development environment? Did you use the --recurse-submodules flag when cloning the repository, as mentioned?"
        
    },
    {
        "Question Category":"Uses Photos, Coding Question, Follow Up Question, See Notes, Pointed to Resource",
        "Questions":"Photo: Error, cannot find symbol class BstBaseVistor\n\nHow do i resolve this error? I updates my antler version, but it still does not work.",
        "Best Human Answer":"Check out the developer FAQs:\n\nhttps:\/\/devdocs.jabref.org\/code-howtos\/faq.html#bstvmvisitorjava157-error-package-bstparser-does-not-exist"
        
    },
    {
        "Question Category":"Follow Up Question, Coding Question, Responce From Oliver",
        "Questions":"the BstBaseVisitor (which is supposed to be derived from the antlr) is also missing from the Bst.g4 ( which is inside the antlr ) and there is no provision in the FAQs for this. if anyone knows how do i get\/derive\/find the BstBaseVisitor class ?",
        "Best Human Answer":"I suggest that you do a clean set-up from scratch. Follow each and every step carefully mentioned in the devdocs for setting up. Ideally, if you do so, you should be able to get it up and running.\n\nYou can also ask questions on the gitter chat."
        
    },
    {
        "Question Category":"Seeking Confirmation, Scope Question, Responce From Oliver, Usability Question",
        "Questions":"Finish ToDo in localizationParameterMustIncludeAString.\n\nIt means we don't have case Localization.lang(var + \"test\") or Localization.lang(var1 + \"test\" + var2) in repo, do I need to cover them when I finish the ToDo?",
        "Best Human Answer":"We just support Localization.lang(\"fixed-string\")\n\nThat should be checked. Nothing more."
        
    },
    {
        "Question Category":"Seeking Confirmation, Implied Question, Coding Question, Responce From Oliver, Seeking Code Review, Usability Question",
        "Questions":"IMPLIED QUESTION (\"Which of these solutions works best?\")\n\none of these solution should work, not all of them.\n\n1. finish the ToDo, to cover future string concatenation case in Localization.lang by add StringUtils.countMatches(e.getKey(), \"\\\"\") >= 2\nassertTrue(e.getKey().startsWith(\"\\\"\") || e.getKey().endsWith(\"\\\"\") || StringUtils.countMatches(e.getKey(), \"\\\"\") >= 2, \"Illegal localization parameter found. Must include a String with potential concatenation or replacement parameters. Illegal parameter: Localization.lang(\" + e.getKey());\n\n2. just fix comment without code change, such as delete the ToDo comment and add the link to https:\/\/devdocs.jabref.org\/code-howtos\/localization.html\n\n3. fix the code by delete e.getKey().endsWith(\"\\\"\")\nassertTrue(e.getKey().startsWith(\"\\\"\"), \"Illegal localization parameter found. Must include a String with potential concatenation or replacement parameters. Illegal parameter: Localization.lang(\" + e.getKey());\n",
        "Best Human Answer":"1. finish the ToDo, to cover future string concatenation case in `Localization.lang` by add `StringUtils.countMatches(e.getKey(), \"\\\"\") >= 2`\n\nIMPLIED AND It needs to be ==.\n\nStringUtils.countMatches(e.getKey() is a great idea 👍. Simple and efficient."
        
    },
    {
        "Question Category":"Usability Question, Implied Question, Uses Photos, See Notes, Requesting Issue Creation, Requesting Issue Completion, , Pointed to Resource, Alike To Other Problem",
        "Questions":"\"Automatically sync bibliography when inserting citations\" does not work with JStyles #11684\n\nSteps to reproduce the behaviour\nOpen Chocolate.bib\nConnect to a running LibreOffice document instance\nSelect a JStyle from the \"Select style\" dialog\nMake sure Settings -> \"Automatically sync bibliography when inserting citations\" is enabled\nimage\nCite any entry into the document. [You will notice that bibliography section is not generated automatically]\nClick the \"Make\/Sync\" bibliography option. [A bibliography section will be generated].\nCite another entry in the document [You will notice that the bibliography section is not updated automatically]\n\nImplied: Why?",
        "Best Human Answer":"Refs. subhramit#26 and #11683."
        
    },
    {
        "Question Category":"Usability Question, Implied Question, Responce From Oliver, Requesting Issue Creation, Pointed to Resource, Alike To Other Problem, New User, Coding Question",
        "Questions":"Issue Reproduction\nRun any test in src\/test\/java\/org\/jabref\/logic\/importer\/fetcher\/ACSTest.java\nDebug the retrieved document by the findByDOI() method in src\/main\/java\/org\/jabref\/logic\/importer\/fetcher\/ACS.java\nNotice that no matter the given DOI or URL to the method, the request runs into a HTTP 403 error code with the following message:\n\norg.jsoup.HttpStatusException: HTTP error fetching URL. Status=403\n\nCurrently, the request through JSoup is ignoring any kind of HTTP error in line 54.\nThis seams in any way a wrong behavior, since the implementation ignores documents not found.\nThe retrieved document is still parsed and the method always returns an Optional.empty() rendering all test cases useless.\n\nImplied: Can this be fixed?",
        "Best Human Answer":"Such issues arise when the website is using Cloudflare to protect the website as it uses some dynamically JavaScript. The solution would be to enable a kind of web based fetching: Refs #11093"
        
    },
    {
        "Question Category":"OSS User, Usability Question, Implied Question, Coding Question, Responce From Oliver, Requesting Issue Completion, Pointed to Resource",
        "Questions":"When running Code -> Analyze Code -> Run Inspection by Name -> Deprecated API Usage (Java | Code Maturity in the IntelliJ IDEA, I find 142 warnings about the usage of deprecated Java APIs in the code base.\n\nSolution\nRefactor the deprecated API usages without changing the functionality and performance of the given code base.\n\nAcceptance Criteria\nWhen running the workflow despcibed in the Background section, no depracted API usages are documented in the main branch.\nIn a situation, when the usage of deprecated APIs is currently necessary and inevitable, a clear JavaDoc is provided why this is the case and marked for later refactoring.\n\nImplied: Can someone do this?",
        "Best Human Answer":"@viktorkrimstein Please show up at my office of University of Stuttgart - or at my second office Sindelfingen; and we can pair on this. -- If you feel brave enough, you can open pull requests for yourself.\n\n@viktorkrimstein Some more ideas: Rules for refactoring could be added to OpenRewrite. Maybe, you can craft minimal examples and create issues at the OpenRewrite repository. With that, the whole Java ecosystem would benefit."
        
    },
    {
        "Question Category":"Follow Up Question, Seeking Confirmation, OSS User, Coding Question, Seeking Code Review, , Context Needed, Pointed to Resource, Large Text, Usability Question",
        "Questions":"I want to replace Deprecated org.jabref.logic.bibtex.InvalidFieldValueException to org.jabref.logic.integrity.IntegrityCheck, but I find it very difficult to refactor it, since the IntegrityCheck need a lot of input parameters such as BibDatabaseContext,FilePreferences,CitationKeyPatternPreferences, but some class with InvalidFieldValueException don't have them, do I need add all these parameters to any class with InvalidFieldValueException? @koppor\n\nI saw you put a @deprecated on org.jabref.logic.preferences.JabRefCliPreferences#getInstance:\n\n\/**\n     * @return Instance of JaRefPreferences\n     * @deprecated Use {@link CliPreferences} instead\n     *\/\n    @Deprecated\n    public static JabRefCliPreferences getInstance() {\n        if (JabRefCliPreferences.singleton == null) {\n            JabRefCliPreferences.singleton = new JabRefCliPreferences();\n        }\n        return JabRefCliPreferences.singleton;\n    }\nbut the CliPreferences is an interface which can't return a singleton, could you tell me what should I do to remove this Deprecated method? @koppor",
        "Best Human Answer":"I  remember that InvalidFieldValueException was one of the more complicated things to refactor, since we wanted to move away from exception that control program flow and only use them for really exceptional situations (see https:\/\/github.com\/HugoMatilla\/Effective-JAVA-Summary?tab=readme-ov-file#57-use-exceptions-only-for-exceptional-conditions). I believe refactoring that is not just about moving methods and variables around, but requires a lot of more thinking and changes to the logical behavior.\"\n\nIf you want to refactor, please work first on the easy ones, there are plenty in the code. You start with the complicated ones. As we have day jobs it's pretty hard to keep up otherwise."
        
    },
    {
        "Question Category":"Usability Question, Implied Question, Coding Question, Responce From Oliver, Scope Question, Best Decision NEEDED!, Uses Photos, See Notes, Requesting Issue Creation, , Pointed to Resource, No Clear Answer, \"Unanswered\"",
        "Questions":"Uncaught java.lang.NullPointerException\n#11654\n\nSteps to reproduce the behaviour\nSelect a search group\nDrag an entry to another group that excludes the entry from the search group\nSelect another group => Uncaught exception\nPossibly related to #11628\n\nJabRef 5.16--2024-08-13--1374813\nLinux 6.9.9-1-default amd64\nJava 21.0.2\nJavaFX 22.0.2+4\n\nImplied: Why?",
        "Best Human Answer":"I am now on JabRef 5.16--2024-08-26--1620002 and will try to reproduce the exception. There isn't anything in the trace that I can decipher, so here are some details that could be important (guesses).\n\nthe library contains about 120 user-created groups plus a long list created by JabRef from the keywords field.\nThe groups and search groups associated with the exception were user-created.\nThe search groups include Boolean statements without regular expressions.\nGroup names include non-alphanumeric characters such as : and \/, with ; as the separator\nMost of the groups are nested one level deep.\nHere are some examples."
        
    },
    {
        "Question Category":"Follow Up Question, OSS User, Coding Question, Responce From Oliver, Scope Question, Seeking Code Review, Seeking Confirmation, New User",
        "Questions":"Also what do you think about the errors ? \nWhat might be my next steps for solving the issue...\n\n(I will try my best to not make any mistakes from now)",
        "Best Human Answer":"Always a learning 😅 - Mistakes are there to learn something new 💪\n\nWhile waiting that gradle started, I was distrcted by another PR. And this test execution worked better a few months ago. I don't know, is it my IntelliJ, is it a general eco system issue -- nothing you can do."
        
    },
    {
        "Question Category":"Follow Up Question, OSS User, Implied Question, Coding Question, Responce From Oliver, Seeking Code Review, See Notes, Context Needed, Pointed to Resource, Several Similar Questions",
        "Questions":"LOGGER ERROR MESSAGE:\n  int status;\n            try {\n                status = httpURLConnection.getResponseCode();\n            } catch (IOException e) {\n                System.out.println(\"Exception caught\");\n                LOGGER.error(\"Error getting response code\", e);\n                \/\/ TODO: Convert e to FetcherClientException\n                throw e;\n            }\n\nwhile the IOException occurs i am not able to see the log message in the console , i tried adding a print statement as well for testing but still could not see it,\nThen i forced and explicitly throw a IOException in the try block and could saw the log and print message\n\nImplied: Why does it do this?",
        "Best Human Answer":"Log: Please adjust the log level. See https:\/\/devdocs.jabref.org\/code-howtos\/logging.html for details."
        
    },
    {
        "Question Category":"Follow Up Question, OSS User, Implied Question, Coding Question, Responce From Oliver, Scope Question, Seeking Code Review, See Notes, Context Needed, Pointed to Resource, Several Similar Questions",
        "Questions":"while the IOException occurs i am not able to see the log message in the console , i tried adding a print statement as well for testing but still could not see it,\nThen i forced and explicitly throw a IOException in the try block and could saw the log and print message\n\nImplied: Why does it do this?",
        "Best Human Answer":"Exception: You need to see the exception from the provider.\nOh, the exception should be seeable, because it is \"error\". Error is always displayed.... Strange...\nException: Please try the providers until you see an exception. Reason: we want to handle errors coming from them - and we need to get to know them. We cannot simulate, because we don't know their errors. We need to know their errors."
        
    },
    {
        "Question Category":"Seeking Confirmation, OSS User, Coding Question, Responce From Oliver, Seeking Code Review, New User, Requesting Issue Completion, , Brainstorming Fix",
        "Questions":"SimpleHttpResponse httpResponse = new SimpleHttpResponse(httpURLConnection);\nLOGGER.info(\"HTTP {} {} - body: {}\", status, httpURLConnection.getResponseMessage(),   \nhttpURLConnection.getContentLength() > 0 ? httpURLConnection.getContent() : \"\");\n\n\nI think this log can create problems\n\ncan we change this to ?\n\n\n LOGGER.info(\"HTTP {} {} - body: {}\", status, httpResponse.responseMessage(), \n!httpResponse.responseBody().isEmpty() ? httpResponse.responseBody() : \"\");\n",
        "Best Human Answer":"SimpleHttpRepsone object should be used. It should be enriched by toString. And logger then only one {} and SimpleHttpRepsone as parameter "
        
    },
    {
        "Question Category":"OSS User, Implied Question, Scope Question, Requesting Issue Assignment, Pointed to Resource, Requesting More Info, New User",
        "Questions":"Hello everyone,\nI'm Malay Dewangan, a backend developer with one year of experience currently working at WorldRef.\nI'm reaching out to express my interest in contributing to this open source project and I'm excited about the opportunity to get involved.\nI'd love to learn more about how I can best contribute.\nLooking forward to working with you all.\n\nImplied: Where can I start?",
        "Best Human Answer":"Hello \nMalay Dewangan\n , there are good first issues that ease you into the code base. If you are very comfortable with and proficient at Java coding, you also can choose other issues that spark your interest. :-) Check out the developers documentation abou thow to set up a local workspace. That's probably the first thing you should do. See https:\/\/devdocs.jabref.org\/contributing.html"
        
    },
    {
        "Question Category":"OSS User, Implied Question, Scope Question, Pointed to Resource, Several Similar Questions, New User",
        "Questions":"Hello all! I'm interested in attempting a contribution to the SSRN pasting issue described here https:\/\/github.com\/JabRef\/jabref\/issues\/11687, but am new to the research domain, and would like some clarification regarding a few things. I've briefly read the architecture overview (MVC with different names and some other decisions, it seems), and will dive into finer detail on my own. Would anyone be willing to help explain what I need to know to implement?",
        "Best Human Answer":"Welcome to JabRef! Thanks for your interest. I would advise you to pick another issue, as this appears to be harder than I initially thought.\nHowever, the basic idea would be to create an IdBasedfetcher that parses the html content and extracts the metadata to create bibtex"
        
    },
    {
        "Question Category":"Follow Up Question, Seeking Confirmation, OSS User, Scope Question, Requesting Issue Assignment, Pointed to Resource, New User",
        "Questions":"How would https:\/\/github.com\/JabRef\/jabref\/issues\/11691 be as a first issue instead then?\n\nAdd an option to add \"Cited on pages\" in JStyle bibliography · Issue #11691 · JabRef\/jabref - GitHub\n\nThere exists a mechanism in JabRef to add \"Cited on pages: ...\" to bibliography entries when using JStyle citations. However, this is presently not accessible to the user to be triggered, thus rend...\nAnd thank you for your reply, by the way, I appreciate the feedback :)",
        "Best Human Answer":"Have you worked on a Java app before? If yes, you can give it a go."
        
    },
    {
        "Question Category":"Seeking Confirmation, OSS User, Coding Question, Scope Question, Best Decision NEEDED!, See Notes, , Pointed to Resource, New User",
        "Questions":"First question on #11691 (Add cited on pages to JStyle bibliography): The github issue mentions that \"It would be even better if this can be added as a user preference.\". By user preference, do we mean JabRefPreference, which seems to me like the highest level preference class, or OpenOfficePreferences, which is OO specififc? Basically, is the \"Cited on pages\" \"text addition a JabRef thing, or an OpenOffice thing?",
        "Best Human Answer":"Hello Austin, Issue related questions are best asked within the issues or the pull-request.\n\nOR\n\nUser Preferences refers to JabRef Prefernesc in general and in this case to OpenOfficePreferences"
        
    },
    {
        "Question Category":"Follow Up Question, Seeking Confirmation, OSS User, Usability Question, Coding Question, Scope Question, Hypothetical, New User",
        "Questions":"Quick question, should I report an issue if it only occurs in the IDE on latest main commit, and not in the released 5.15 AUR package? I'm unable to open the Preferences panel because the app freezes, but only in my dev environment",
        "Best Human Answer":"Yes please, the main will always become the next release it's important that it works fine.\nRegarding the prefs issue, it might be the keyring access stuff, at least under mac I get a dialog asking for access to password"
        
    },
    {
        "Question Category":"OSS User, Usability Question, Coding Question, Responce From Oliver, Uses Photos, New User, Implied Question",
        "Questions":"Context: I am getting error while build the project (Image Attached Below)\n\nImage transcript: Exception is:\n› org.gradle.api.tasks.TaskExecutionException Create breakpoint: Execution failed for task ':test'\n<23 internal lines>\n› Caused by: org-gradle.api.BuildCancelledException Create breakpoint: Build cancelled while executing task ': test'\n<88>\n\nImplied Question: Why?",
        "Best Human Answer":"Question: Did you press the stop button?"
        
    },
    {
        "Question Category":"OSS User, Usability Question, Coding Question, See Notes, \"Unanswered\", Pointed to Resource, Requesting More Info, Seeking Confirmation",
        "Questions":"Hi,\ncan anybody provide a more elobarate explenaition on how to properly use org.jabref.gui.actions.ActionFactory#configureIconButton ? \nI think, i need to understand it to properly \"fix\" my issue https:\/\/github.com\/JabRef\/jabref\/pull\/11842 . Also is there a more specific documentatio than https:\/\/devdocs.jabref.org\/ ?",
        "Best Human Answer":"No Responce yet"
        
    }
]
